notes/meeting_2021dec05.org
* meeting notes December 05, 2021                                      
** the raku study group
*** Raku takes Knight

** usual links
*** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021dec05.md 
*** https://github.com/doomvox/raku-study/bin/2021dec05

** bg code:
https://gist.github.com/Util/b23d37e9f512ec1193e0664b6df30568

** extracted from meeting chat:
**** damian conway interview from 2010 
http://www.josetteorama.com/damian-conway-on-perl-and-its-future/ 


** Ralph's remarks on the left-hand junction with smartmatch issue:
*** https://github.com/rakudo/rakudo/issues/4615

** announcments 
*** For the svlug on january 6th, I'll be talking about Raku

** next meeting
*** next meeting: december 19 
*** announcment: svlug jan 6 (i think) a raku talk of some sort by me.
