notes/meeting_2021dec05.md
- [meeting notes December 05, 2021](#org86045b4)
  - [the raku study group](#orge07a621)
    - [Raku takes Knight](#orga929e38)
  - [usual links](#orgc9c3da1)
    - [<https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021dec05.md>](#org94fbe3b)
    - [<https://github.com/doomvox/raku-study/bin/2021dec05>](#org142d775)
  - [bg code:](#org3c8b07f)
  - [extracted from meeting chat:](#org8a42b66)
  - [Ralph's remarks on the left-hand junction with smartmatch issue:](#org094435e)
    - [<https://github.com/rakudo/rakudo/issues/4615>](#org6f52722)
  - [announcments](#org3cfe85f)
    - [For the svlug on january 6th, I'll be talking about Raku](#orgf87a8b1)
  - [next meeting](#org3c1cc58)
    - [next meeting: december 19](#org618a969)
    - [announcment: svlug jan 6 (i think) a raku talk of some sort by me.](#orge348bdf)


<a id="org86045b4"></a>

# meeting notes December 05, 2021


<a id="orge07a621"></a>

## the raku study group


<a id="orga929e38"></a>

### Raku takes Knight


<a id="orgc9c3da1"></a>

## usual links


<a id="org94fbe3b"></a>

### <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021dec05.md>


<a id="org142d775"></a>

### <https://github.com/doomvox/raku-study/bin/2021dec05>


<a id="org3c8b07f"></a>

## bg code:

<https://gist.github.com/Util/b23d37e9f512ec1193e0664b6df30568>


<a id="org8a42b66"></a>

## extracted from meeting chat:

1.  damian conway interview from 2010

    <http://www.josetteorama.com/damian-conway-on-perl-and-its-future/>


<a id="org094435e"></a>

## Ralph's remarks on the left-hand junction with smartmatch issue:


<a id="org6f52722"></a>

### <https://github.com/rakudo/rakudo/issues/4615>


<a id="org3cfe85f"></a>

## announcments


<a id="orgf87a8b1"></a>

### For the svlug on january 6th, I'll be talking about Raku


<a id="org3c1cc58"></a>

## next meeting


<a id="org618a969"></a>

### next meeting: december 19


<a id="orge348bdf"></a>

### announcment: svlug jan 6 (i think) a raku talk of some sort by me.
